# Требуется посчитать сумму целых чисел, расположенных между числами 1 и N включительно.
#
# Входные данные
# В единственной строке входного файла INPUT.TXT записано единственное целое число N,
# не превышающее по абсолютной величине 10^4.
#
# Выходные данные
# В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число — сумму чисел,
# расположенных между 1 и N включительно.
#
# Пример
# №	INPUT.TXT	OUTPUT.TXT
# 1	5	        15

# Чтение входных данных из файла
with open('INPUT.TXT', 'r') as input_file:
    n = int(input_file.readline().strip())

# Вычисление суммы чисел от 1 до N включительно
if n >= 1:
    # Если N положительное, используем формулу арифметической прогрессии
    result = n * (n + 1) // 2
else:
    # Если N отрицательное, суммируем от 1 до N (в обратном порядке)
    result = n * (n - 1) // 2 * (-1) + 1

# Запись результата в выходной файл
with open('OUTPUT.TXT', 'w') as output_file:
    output_file.write(str(result))

print(result)